In [2]:
from io import StringIO

import numpy as np
import pandas as pd

In [17]:
data = {'Birth': ['9-1-1900', '1-3-1904', '2-28-1889'],
       'Name': [ 'Fred', 'Márge', 'Henry'],
       'Color': ['Red', 'Blue', None],
       'Number': [3, 1, 9]} # option-e a á
df = pd.DataFrame(data)
df['Birth'] =pd.to_datetime(df['Birth'])
df

       Birth Color   Name  Number
0 1900-09-01   Red   Fred       3
1 1904-01-03  Blue  Márge       1
2 1889-02-28  None  Henry       9

## Excel

In [4]:
df

       Birth Color   Name  Number
0   9-1-1900   Red   Fred       3
1   1-3-1904  Blue  Márge       1
2  2-28-1889  None  Henry       9

In [18]:
df.dtypes

Birth     datetime64[ns]
Color             object
Name              object
Number             int64
dtype: object

In [19]:
df.to_excel('/tmp/names.xls') # pip install xlwt

In [20]:
df_xls = pd.read_excel('/tmp/names.xls') # pip install xlrd

In [21]:
df_xls

       Birth Color   Name  Number
0 1900-09-01   Red   Fred       3
1 1904-01-03  Blue  Márge       1
2 1889-02-28   NaN  Henry       9

In [22]:
df_xls.dtypes

Birth     datetime64[ns]
Color             object
Name              object
Number             int64
dtype: object

In [23]:
df.to_excel('/tmp/names.xlsx') # pip install openpyxl

In [24]:
df_xlsx = pd.read_excel('/tmp/names.xlsx')

In [25]:
df_xlsx

       Birth Color   Name  Number
0 1900-09-01   Red   Fred       3
1 1904-01-03  Blue  Márge       1
2 1889-02-28   NaN  Henry       9

In [26]:
df_xlsx.dtypes

Birth     datetime64[ns]
Color             object
Name              object
Number             int64
dtype: object